"""Модуль описує помилки пакету Template"""


class TemplateValidationError(Exception):
    """Викликається у випадку невалідної структури директорії/метаданих
    шаблону або версії шаблону."""


class DuplicationError(Exception):
    """Викликається у випадку спроби створити сутність
    з ідентифікатором, що вже наявний в системі."""


class StorageError(Exception):
    """Викликається у випадку помилки на стороні сховища."""


class NotFoundError(Exception):
    """Викликається, коли дані за запитом не було знайдено."""
